# Intermediate SQL

## Filtering Records

#### Combining filtering and selecting

Time for a little challenge. So far, your SQL vocabulary from this course includes COUNT(), DISTINCT, LIMIT, WHERE, OR, AND, BETWEEN, LIKE, NOT LIKE, and IN. In this exercise, you will try to use some of these together. Writing more complex queries will be standard for you as you become a qualified SQL programmer.

As this query will be a little more complicated than what you've seen so far, we've included a bit of code to get you started. You will be using DISTINCT here too because, surprise, there are two movies named 'Hamlet' in this dataset!

Follow the instructions to find out what 90's films we have in our dataset that would be suitable for English-speaking teens.

In [2]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Instructions
* Select the `title` and `release_year` of all films released in 1990 or 2000 that were longer than two hours.
* Select the `title` and `language` of all films in English, Spanish, or French using `IN`.
* Select the `title`, `certification` and `language` of all films NC-17 or R that are in English, Italian, or Greek.

In [4]:
# -- Find the title and release_year for all films over two hours in length released in 1990 and 2000
sql = """
SELECT title, release_year
FROM films
WHERE release_year IN (1990, 2000)
    AND duration > 120
"""
run_statement(sql)

                             0     1
0           Dances with Wolves  1990
1                   Die Hard 2  1990
2                        Ghost  1990
3                   Goodfellas  1990
4             Mo' Better Blues  1990
5                 Pretty Woman  1990
6      The Godfather: Part III  1990
7     The Hunt for Red October  1990
8        All the Pretty Horses  2000
9                Almost Famous  2000
10                  Bamboozled  2000
11                   Cast Away  2000
12                    Chocolat  2000
13          Dancer in the Dark  2000
14             Erin Brockovich  2000
15           Finding Forrester  2000
16                        Fiza  2000
17                   Gladiator  2000
18       Gone in Sixty Seconds  2000
19           Keeping the Faith  2000
20           Love & Basketball  2000
21                Men of Honor  2000
22      Mission: Impossible II  2000
23                Pandaemonium  2000
24              Pay It Forward  2000
25                     Pollock  2000
26               Proof of Life  2000
27                      Quills  2000
28              Reindeer Games  2000
29               Space Cowboys  2000
30                 The 6th Day  2000
31               The Contender  2000
32              The Family Man  2000
33          The House of Mirth  2000
34  The Legend of Bagger Vance  2000
35                 The Patriot  2000
36           The Perfect Storm  2000
37               Thirteen Days  2000
38                     Traffic  2000
39              Vertical Limit  2000
40           What Lies Beneath  2000
41             What Women Want  2000

* Select the `title` and `language` of all films in English, Spanish, or French using `IN`

In [5]:
# -- Find the title and language of all films in English, Spanish, and French
sql = """
SELECT title, language
FROM films
WHERE language IN ('English', 'Spanish', 'French')
"""
run_statement(sql)

                                        0        1
0                                  Sheena  English
1                                  Splash  English
2     Star Trek III: The Search for Spock  English
3                              The Bounty  English
4                         The Cotton Club  English
...                                   ...      ...
4742                              Twisted  English
4743                          Unforgotten  English
4744                                Wings  English
4745                           Wolf Creek  English
4746                    Wuthering Heights  English

[4747 rows x 2 columns]

* Select the `title`, `certification` and `language` of all films certified NC-17 or R that are in English, Italian, or Greek.

In [9]:
sql = """
SELECT title, certification, language
FROM films
WHERE title = 'The Cotton Club' OR title = 'The Terminator'
"""
run_statement(sql)

                 0  1        2
0  The Cotton Club  R  English
1   The Terminator  R  English

* Finally, amend the query to include all Spanish-language `or` French-language films with the same criteria.

In [9]:
sql = """
SELECT title, release_year
FROM films
WHERE release_year BETWEEN 1990 AND 2000
	AND budget > 100000000
-- Amend the query to include Spanish or French-language films
	AND (language = 'Spanish' OR language = 'French')
"""
run_statement(sql)

                                         0     1
0  Les couloirs du temps: Les visiteurs II  1998
1                                    Tango  1998

In [ ]:
sql = """
UPDATE SALESMAN
SET SNAME = 'Sally'
WHERE SNAME = 'Sully'

"""
run_statement(sql)